# Clear Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoutingConditions..::..Clear Method
RoutingConditions Class See Also
---
Clear all existing conditions
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void Clear()
```

Visual Basic
---
```text
Public Sub Clear
```

Visual C++
---
```text
public:
void Clear()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also
RoutingConditions Class
Autodesk.Revit.DB Namespace